app/views/articles/index.html.erb

      <td><%= article.text %></td>
      <td><%= article.comments.count %></td>
---
SELECT AVG(title) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]